Revit 2024 API
CutLineType Enumeration
 The available line types for a stairs cut line.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum CutLineType
Visual Basic
Public Enumeration CutLineType
Visual C++
public enum class CutLineType
Members
Member name | Description
SingleLine |  Cutline type is single-line.
DoubleLine |  Cutline type is double-line.
See Also
Autodesk.Revit.DB.Architecture Namespace